from flask import jsonify

food_provinces = [
    {
        'id': 1,
        'name': 'ខេត្ត មណ្ខលគីរី',
        'type': 'foodProvince',
        'image': 'https://th.bing.com/th/id/R.bf1b728468beeb327831ec95c6413ecc?rik=jmRj7XgjSEv8Bw&pid=ImgRaw&r=0',
        'detail': [
            {
                'namey': 'ម្ហូប ស៊ុបគោ',
                'imagey': 'https://media.tacdn.com/media/attractions-splice-spp-720x480/0a/9f/8c/cc.jpg',
                'information': [
                    {
                        'images': 'https://media.tacdn.com/media/attractions-splice-spp-720x480/0a/9f/8c/cc.jpg',
                        'ingredient': '''
                        Rice: A staple in Cambodian meals.
                        Fish: Cambodian cuisine often includes fish, either freshwater or marine fish.
                        Vegetables: Various vegetables like lemongrass, galangal, kaffir lime leaves,
                        and different herbs are used to add flavor to dishes.
                        Rice Noodles: Rice noodles are commonly used in soups and stir-fried dishes.
                        Coconut Milk: Used in curries and desserts for a rich and creamy flavor.
                        Chilies: Add spice to many Cambodian dishes.
                        Palm Sugar: Commonly used as a sweetener in Cambodian cuisine.
                        Fish Sauce: A fundamental ingredient in Cambodian cooking for umami flavor.
                        Lime or Tamarind Juice: Used for sourness in various dishes.
                        Garlic and Shallots: These aromatics are often used for flavoring.'''
                    }
                ]
            },
            {
                'namey': 'ម្ហូប បាយពងទាចៀន',
                'imagey': 'https://i.pinimg.com/originals/24/a3/84/24a38408ea9ac1f40dc0f962fb28cb4f.jpg',
                'information': [
                    {
                        'images': 'https://i.pinimg.com/originals/24/a3/84/24a38408ea9ac1f40dc0f962fb28cb4f.jpg',
                        'ingredient': '''
                        Rice: A staple in Cambodian meals.
                        Eggs: Depend on you want.
                        Fish source: To make our dish good.
                        Vegetables: Galic leaves, white Galic, Carrot, Beans,..etc.
                        Meats: Chicken, Suasage, Beef, or Pork.
                        Pepper, Chilli, Salt, Sugar, and a little bit of water.
                        '''
                    }
                ]
            },
            {
                'namey': 'ម្ហូប ប្រហិតចៀនជាមួយទឹកម្ទេស',
                'imagey': 'https://i.pinimg.com/originals/55/cc/42/55cc425bf5c1a1ce8aaf3e69d30034d7.jpg',
                'information': [
                    {
                        'images': 'https://i.pinimg.com/originals/24/a3/84/24a38408ea9ac1f40dc0f962fb28cb4f.jpg',
                        'ingredient': '''
                        ប្រហិតគ្រប់មុខ ឬក៍ប្រភេទណាក័បាន,
                        មានទឹកម្ទេស យើងអាចធើ្វក៍បាន ឬ
                        ក៍យើងអាចទិញពីផ្សារក៏បានដែរ,
                        បន្លែមានដូចជា: ត្រសក់, ម្រះ, ការ៉ុត, ...etc.
                        '''
                    }
                ]
            },
        ],
    },
    {
        'id': 2,
        'name': 'ខេត្ត​តាកែវ',
        'type': 'foodProvince',
        'image': 'https://th.bing.com/th/id/OIP.D8t9RuoiQSb8_fBNLf4DegHaE9?rs=1&pid=ImgDetMain',
        'detail': [
            {
                'namey': 'ម្ហូប បង្កងអាំង',
                'imagey': 'https://th.bing.com/th/id/OIP.8LOGrw9Okr3UcUnqkEb01QHaE8?rs=1&pid=ImgDetMain',
                'information': [
                    {
                        'images': 'https://th.bing.com/th/id/OIP.8LOGrw9Okr3UcUnqkEb01QHaE8?rs=1&pid=ImgDetMain',
                        'ingredient': '''
                        - បង្កង 
                        - ម្ទេស 
                        - ស្ករស 
                        - អំបិល 
                        - ក្រូចឆ្មារ 
                        - ខ្ទឹមស
                        ''',
                        'Step': '''
                        ១- បង្កងស្រស់ ៥០០ក្រាម , ម្ទេសខ្មាំង ២ស្លាបព្រាបាយ, ខ្ទឹមស ១ស្លាបព្រាបាយ,
                        ស្ករត្នោត ១ស្លាបព្រាកាហ្វេ, អំបិលម៉ត់ ១ស្លាបព្រាកាហ្វេ, ទឹកក្រូចឆ្មារ ២ស្លាបព្រាបាយ។
                        ២-លាងបង្កងអោយស្អាត ដោយជាមួយឈើចុងស្រួច អាំងអោយឆ្អិនល្ម​ម ទុកមួយអន្លើ
                        ៣- ធ្វើទឹកជ្រលក់ ដោយយកម្ទេសខ្មាំង នឹងខ្ទឹមស បុកលាយគ្នាអោយម៉ត់ បន្ទាប់មក ផ្សំរសជាតិ
                        ដោយស្ករត្នោត អំបិលម៉ត់ និងទឹកក្រូចឆ្មារ ភ្លក្សមើលអោយត្រូវមាត់ ជាការស្រេច ។
                        ''',                        
                    }
                ]
            },
            {
                'namey': 'ម្ហូប មីឆាសាច់គោ',
                'imagey': 'https://th.bing.com/th/id/OIP.-bBggS7IUUmViEpxhOcAlAHaEK?rs=1&pid=ImgDetMain',
                'information': [
                    {
                        'images': 'https://th.bing.com/th/id/OIP.-bBggS7IUUmViEpxhOcAlAHaEK?rs=1&pid=ImgDetMain',
                        'ingredient': '''
                        - សាច់គោ ៣០០ក្រាមហាន់ស្តើងៗ
                        - មីសសៃមូល ២៥០ក្រាម
                        - ខ្ញី, ខ្ទឹមស ២ស្លាបព្រាបាយ(ចិញ្ច្រាំ)
                        - ស្លឹកខ្ទឹម ២ដើមហាន់
                        - ការ៉ុត ចិតចំណិតវែង, ផ្សិត ចិតចំណិត, សណ្តែកគួរ កាត់ ២ថ្នាំងដៃ ១មុខបន្តិច
                        - ទឹកស៊ីអ៊ីវ ២ស្លាបព្រាបាយ
                        - ប្រេងល្ង ១ស្លាបព្រាបាយ
                        - ទឹកខ្មេះ កន្លះស្លាបព្រាបាយ
                        - ស្ករស កន្លះស្លាបព្រាបាយ
                        - ម្សៅមី ១ស្លាបព្រាកាហ្វេ
                        - ប្រេងឆា ២ស្លាបព្រាបាយ
                        ''',
                        'Step': '''
                        ១. មុន​ដំ​​បូង​យក​សាច់​គោ​មក​​ប្រឡាក់​​ជា​មួយ​​ទឹក​ស៊ីអ៊ីវ ១ស្លាបព្រាបាយ និងម្សៅ​មី​ ១ស្លាបព្រាកាហ្វេ​ឲ្យ​បាន​សព្វ។
                        ២. យក​ទឹក​ កន្លះ​កូន​ចាន​មក​លាយ​ជា​មួយ ទឹកស៊ីអ៊ីវ, ប្រេងល្ង, ទឹកខ្មេះ, ស្ករស និងម្សៅមី​​ កូរ​ចូល​គ្នា​ឲ្យ​សព្វ។
                        ៣.ដាក់​ប្រេងឆា​ចូល​ក្នុង​ខ្ទះ​ទុក​ឲ្យ​ក្តៅ​ដាក់​ខ្ញី​ចូល​ឆា​​ប្រហែល​ ១នាទី ចាំ​ដាក់​សាច់​គោ​ចូលឆា​ ២-៣នា​ទី​ទៀត​ដួស​ទុក​សិន​។
                        ៤. ដាក់​ប្រេង​ឆា​ចូល​ក្នុង​ខ្ទះ​ម្តង​ទៀត​រួច​បំពងខ្ទឹម​ស​​ឲ្យ​ឈ្ងុយ ទើបដាក់​ការ៉ុត សណ្តែកគួរ​ និង
                        ​ផ្សិតឆា​ឲ្យ​បន្លែរាង​ស្រពាប់​ដាក់​គ្រឿង​ផ្សំ​​នៅក្នុង​កូន​ចាន​ចូល។
                        ៥. ទុក​ប្រហែល​ ២-៣នាទី​ដាក់​មី ​ឆា​ចូល​​គ្នា​បន្តិច​សិន​ចាំដាក់​សាច់​គោ​ដែល​ឆា​ម្តងរួច​ហើយ​
                        ឆា​ចូល​គ្នា​ទាំង​អស់​រួច​ដាក់​ស្លឹក​ខ្ទឹម​ចុងក្រោយ​ជាការ​ស្រេច៕
                        ''',
                    }
                ]
            },
            {
                'namey': 'ម្ហូប លតឆាសាច់គោ',
                'imagey': 'https://th.bing.com/th/id/OIP.-U0XRJIQuKAk6COQCYVpmwHaEK?rs=1&pid=ImgDetMain',
                'information': [
                    {
                        'images': 'https://th.bing.com/th/id/OIP.-bBggS7IUUmViEpxhOcAlAHaEK?rs=1&pid=ImgDetMain',
                        'ingredient': '''
                        -សាច់គោ ២០០ក្រាម ហាន់បន្ទះស្តើងៗ
                        -ស៊ុត ១គ្រាប់ ចៀនឆ្អិន
                        -លត ១ចានគោមតូចល្មម
                        -ខាត់ណា ២ដើម ហាន់បន្ទះស្តើងៗ
                        -ផ្កាគូឆាយ ២៥ក្រាមកាត់ ២ថ្នាំងដៃ
                        -សណ្តែកបណ្តុះ ២៥ក្រាម
                        -ទឹកស៊ីអ៊ីវខាប់ ១ស្លាបព្រាបាយ
                        -ស្ករស កន្លះស្លាបព្រាកាហ្វេ
                        -ខ្ទឹមសចិញ្ច្រាំ ១ស្លាបព្រាបាយ
                        -ប្រេងឆា ២
                        -៤ស្លាបព្រាបាយ
                        ''',
                        'Step': '''
                        -ដំបូងដាក់ប្រេងឆាចូលក្នុងខ្ទះដាក់ភ្លើងឱ្យក្តៅ ដាក់ខ្ទឹមសចូលឆាឱ្យឈ្ងុយដាក់សាច់គោ
                        ចូលឆាត្រឡប់បន្តិចដាក់ទឹកស៊ីអ៊ីវខាប់ និងស្ករសឆាឱ្យរាងឆ្អិនល្មម។
                        -បន្ទាប់មកដាក់លតចូលឆាវាជាមួយសាច់គោបន្តិចសិន រួចហើយចាំដាក់ ខាត់ណា, ផ្កាគូឆាយ
                        និងសណ្តែកបណ្តុះ ឆាឱ្យបន្លែឆ្អិនតាមការចូលចិត្តរួចដួសដាក់ក្នុងចាន។បន្ទាប់មកទៀតយកស៊ុតមកដាក់ចៀនឱ្យឆ្អិន
                        រួចហើយដួសដាក់ពីលើចានលតឆាជាការស្រេច៕
                        ''',
                    }
                ]
            },
        ],
    },
    {
        'id': 3,
        'name': 'ខេត្ត កណ្តាល',
        'type': 'foodProvince',
        'image': 'https://th.bing.com/th/id/R.50be05010cd5bda403018a15846f0314?rik=lfYtBGFACzTe5A&riu=http%3a%2f%2fwww.soprita.com%2fwp-content%2fuploads%2f2021%2f04%2f1680-840-Kandal-01.png&ehk=RkhYJh9QKUhNCKlocTUwKHbGSFAhD0VJ7ZUur1lz%2f14%3d&risl=&pid=ImgRaw&r=0',
        'detail': [
            {
                'namey': 'ម្ហូប កណ្តុរអាំង',
                'imagey': 'https://th.bing.com/th/id/OIP.NMpNvJNZ5sm8_KkI7L2A-AHaEK?rs=1&pid=ImgDetMain',
                'information': [
                    {
                        'images': 'https://th.bing.com/th/id/OIP.NMpNvJNZ5sm8_KkI7L2A-AHaEK?rs=1&pid=ImgDetMain',
                        'ingredient': '''
                        ១. យើងមានកណ្តុរអាស្រ័យទៅលើចំនួនយើងហូប
                        ២. បន្ទាប់មកយើងមានគ្រឿងផ្សំដូចជា: ម្រេច អំបិល គល់ស្លឹកគ្រៃ ស្ករស ស្លឹកក្រូចជាដើម និងកូចឆ្មារ។
                        ''',
                        'Step': '''
                        ១. យើងត្រូវសម្អាតកណ្តុរអោយស្អាត ហើយយើងត្រូវបង្កាត់ភ្លើង
                        ដើម្បីអាំងកណ្តុរដែលយើងបានធើ្វ។
                        ២. ចំពោះទឹកជ្រលក់យើងមានម្រេច បន្ទាប់មកច្របាត់ក្រូចឆ្មាចូលជាការស្រេច។
                        '''
                    }
                ]
            },
            {
                'namey': 'ម្ហូប សាច់គោអាំង',
                'imagey': 'https://th.bing.com/th/id/OIP.NLBxclVsqDInfp170YDreQHaFa?rs=1&pid=ImgDetMain',
                'information': [
                    {
                        'images': 'https://th.bing.com/th/id/OIP.NLBxclVsqDInfp170YDreQHaFa?rs=1&pid=ImgDetMain',
                        'ingredient': '''
                        - សាច់គោល្អ ឬសាច់ជាប់ខ្លាញ់ តាមចំណង់អ្នកបរិភោគ
                        -​ម្ទេសក្រហម ( សម្រាប់អ្នកមិនចេះហិរមិនបាច់ដាក់ក៏បាន ) 
                        - គល់ស្លឹកគ្រៃ
                        - រំដេង
                        - ខ្ជាយ 
                        - សំបកក្រូចសើច
                        - ខ្ទឹមស
                        - ខ្ទឹមក្រហម
                        - សណ្តែកដីលីង
                        - ស្ករស ឬ ស្ករត្នោត
                        - គ្រឿងការី
                        - សាច់ដូងទុំ
                        - អំបិល ទឹកត្រី
                        - ម៉្សៅស៊ុប
                        - ល្ហុងចាស់
                        - ត្រសក់
                        - ការ៉ុត
                        - ទឹកខ្មេះ
                        ''',
                        'Step': '''
                        - យកសាច់គោហាន់ជាបន្ទះស្តើងៗល្មមហើយទុកមួយអន្លើរសិន
                        - យកគ្រឿង គល់ស្លឹកគ្រៃ រំដេង ខ្ជាយ សំបកក្រូចសើច ខ្ទឹមស ខ្ទឹមក្រហម
                        គ្រឿងការី អំបិល បុកចូលគ្នាអោយម៉ដ្ឋ -យកសាច់ដូងទុំពូតយកទឹកដើម
                        - យកសណ្តែកដីលីងបុកតែកុំអោយល្អិតពេក
                        - យកគ្រឿងដែលបុកហើយ និងសណ្តែកដី ដាក់លាយចូលគ្នាហើយថែមម៉្សៅស៊ុប
                        ទឹកត្រី អោយល្មមទើបយកសាច់គោមកប្រលាក់ជាមួយគ្រឿងអោយសព្វរួចយកមកដោតឈើចង្កាក់ហើយដាក់អាំងជាការស្រេច ។

                        *វិធីធ្វើជ្រក់
                        -  យកល្ហុង ការ៉ុត ត្រសក់មកឈូសជាសសៃ ហើយដាក់ស្ករ អំបិល ទឹកខ្មេះ ផ្អាប់វារវាងប្រាំម៉ោងទើបអាចទទួលទានបាន ។
                        '''
                    }
                ]
            },
             {
                'namey': 'ម្ហូប បាយឆា',
                'imagey': 'https://hilltopcambodia.com/wp-content/uploads/2020/09/MONDULKIRI-FRIED-RICE.jpeg',
                'information': [
                    {
                        'images': 'https://hilltopcambodia.com/wp-content/uploads/2020/09/MONDULKIRI-FRIED-RICE.jpeg',
                        'ingredient': '''
                        - បង្គាបកសំបកវះយកអាចម៍ខ្នងចេញ
                        - មឹកកាត់វាកង់ៗ
                        - ខ្ទឹមសចិញ្ច្រាំ
                        - ទឹកប្រេងខ្ចង
                        - ទឹកត្រី & ប៊ីចេង & ស្ករស
                        - ពងទា ឬពងមាន់
                        - បាយស
                        - អាចដាក់បន្លែក៏បានដូចជា សណ្តែកគួរហាន់កង់ខ្លីៗ ការ៉ុតហាន់ដុំតូចៗ ពោត……
                        ''',
                        'Step': '''
                        1. ដាក់ខ្ទះ ដាក់ប្រេងឆាពេលខ្ទះក្តៅដោយបើកភ្លើងតិចៗ ដាក់ខ្ទឹមស គ្រឿងសមុទ្រ ឆា២-៣ត្រឡប់
                        ដាក់ទឹកប្រេងខ្ចង ទឹកត្រីបន្តិចបានហើយ ស្ករស ប៊ីចេង (ឆាវាចូលគ្នា)។
                        2. ដាក់ពងទាចូល( កុំទាន់អាលឆាចាំអោយពងទាឆ្អិនបន្តិចចាំឆាដើម្បីអោយពងទារៀងដុំបន្តិច)។
                        3. ដាក់បន្លែ (ឆា២-៣ត្រឡប់) ដាក់បាយសចូល ឆាវាចូលគ្នាអោយបាយរៀងក្រៀមស្ងួតបន្តិច
                        រួចភ្លក់មើល ហើយរោយស្លឹកខ្ទឹមពីលើជាការស្រេច។
                        '''
                    }
                ]
            },
        ],
    },
    {
        'id': 4,
        'name': 'ខេត្ត កំពត',
        'type': 'foodProvince',
        'image': 'https://th.bing.com/th/id/OIP.yfA7tJ8J1UfjV_gvI4uWjAHaFj?rs=1&pid=ImgDetMain',
        'detail': [
            {
                'namey': 'ម្ហូប មឹកអាំង',
                'imagey': 'https://th.bing.com/th/id/OIP.dNanhn4piykyfcmPisrXbAHaEK?rs=1&pid=ImgDetMain',
                'information': [
                    {
                        'images': 'https://th.bing.com/th/id/OIP.dNanhn4piykyfcmPisrXbAHaEK?rs=1&pid=ImgDetMain',
                        'ingredient': '''
                        1-មឹកធំ 1ក្បាល
                        2-ទឹកស៊ីអ៊ីវជប៉ុន(shoyu) 4ស្លាបព្រាបាយ
                        3-ទឹកស៊ីអ៊ីវខាប់ 2ស្លាបព្រាបាយ
                        4-ទឹកមីរិន(Milin sausce) 2ស្លាបព្រាបាយ 
                        5-ស្ករស 1ស្លាបព្រាបាយកន្លះ
                        ''',
                        'Step': '''
                        1-លាងមឹកឲ្យស្អាត​ខ្វះយកគ្រឿងក្នុងចេញ
                        2-ផ្សំទឹកស៊ីអ៊ីវ-ទឹកស៊ីអ៊ីវខាប់-មីរិន-ស្ករស កូរឲ្យរលាយចូលគ្នាទុកមួយឡែក 
                        3-យកមឹកមកត្រាំជាមួយទឹកស៊ីអ៊ីវផ្សំ ផ្អាប់ទុក10-15នាទី
                        4-យកមឹកមកអាំងដោយលាបទឹកស៊ីអ៊ីវផ្សំឲ្យបានញឹកញាប់រហូតឆ្អិនល្អ 
                        5-រៀបមឹកដាក់ចាន រួចយកទឹកស៊ីអ៊ីវផ្សំនៅសល់ទៅចំអិនដាក់ស្ករថែម​ រួចយកទៅស្រោចពីលើមឹកជាការស្រេច។
                        ''',
                    }
                ]
            },
            {
                'namey': 'ម្ហូប ក្តាមឆា',
                'imagey': 'https://i.pinimg.com/originals/df/d5/f8/dfd5f87e6df96826c9758efcc5b67c3d.jpg',
                'information': [
                    {
                        'images': 'https://i.pinimg.com/originals/df/d5/f8/dfd5f87e6df96826c9758efcc5b67c3d.jpg',
                        'ingredient': '''
                        - ក្ដាម​ថ្ម 2ក្បាល
                        - ទឹម​ក្រហម 3មើម
                        - ម្សៅ​ឆា 1ស្លាបព្រាកាហ្វេ
                        - ទឹក​ដោះ​គោសុទ្ធ 4ពែងរង្វាល់ ប្រហែលកន្លះចានចង្កឹះ
                        - ស៊ុត​មាន់ 1
                        - ទឹក​ស៊ុប 1ចានចង្កឹះ ឬប្រើទឹកដោះគោជំនួសក៏បាន
                        - ទឹក​ការី​ខាប់
                        - ម្ទេស​ម៉ដ្ឋ 1លស្លាបព្រាកាហ្វេ
                        - ខ្ទឹម​បារាំង 1ផ្លែ
                        - ការ៉ុត 1មើម
                        - ប៉េងប៉ោះ 2ផ្លែ
                        - ស្ករ 1ស្លាបព្រាបាយ
                        - អំបិល 1ស្លាបព្រាកាហ្វេ
                        - ម្សៅស៊ុប 1ស្លាបព្រាកាហ្វេ
                        - ប្រេងខ្យង 1ស្លាបព្រាបាយ
                        ''',
                        'Step': '''
                        1. យក​ក្ដាម​ថ្ម​មក កាត់​ដង្កៀបហើយដំអោយបែក និង​កាត់សាច់ជាដុំៗ ។ រួច​ប្រឡាក់​ជាមួយ​ម្សៅ​ឆា
                        2. និង​អំបិល បន្ទាប់​មក​ដាក់​​បំពង​នៅ​ក្នុង​ឆ្នាំ​ខ្ទះ​ដែល​មាន​ប្រេងកំពុងពុះ ដោយ​ដាក់​ភ្លើង​ឲ្យ​ក្ដៅ​ខ្លាំង​ ប្រែទៅប្រែមក រួច​ស្រង់​ចេញ។
                        3. ដាក់​ខ្ទឹម​ស ម្ទេស​ម៉ដ្ឋ ខ្ទឹម​ក្រហម និង​ទឹក​ការី​ចូល​ទៅ​ក្នុង​ខ្ទះថ្មីមួយ ដើម្បី​បំពង​ឲ្យ​បាន​ឈ្ងុយ
                        4. រួច​ចាក់​ទឹក​ស៊ុប និង​សាច់​ក្ដាម​ចូល​រំងាស់ ដាក់គ្រឿងផ្សំចូល។ ភ្លក្សរសជាតិតាមចំនូលចិត្តរួច រំងាស់បន្តិចដើម្បីឲ្យ​ដាច់​ទឹក
                        5. ចុង​ក្រោយ​បង្អស់ ចាក់​ទឹក​ដោះ​គោ​សុទ្ធ​ចូល បន្ទាប់​មក​ចាក់ពងមាន់​ចូលទៀត ឆាប្រហែល2នាទីរួចរោយស្លឹកខ្ទឹមឬជីវ៉ាន់ស៊ុយក៏បាន
                        6. មុខម្ហូបមួយមុខនេះរួចរាល់ហើយ សូមទទួលទានដោយរីករាយ
                        ''',
                    }
                ]
            },
            {
                'namey': 'ម្ហូប គ្រឿងសមុទ្រក្រឡុក',
                'imagey': 'https://th.bing.com/th/id/OIP.vxN4mFTgrnIsMAiHCgYtoQHaEK?rs=1&pid=ImgDetMain',
                'information': [
                    {
                        'images': 'https://th.bing.com/th/id/OIP.vxN4mFTgrnIsMAiHCgYtoQHaEK?rs=1&pid=ImgDetMain',
                        'ingredient': '''
                        - គ្រឿងសមុទ្រគ្រប់ប្រភេទតាមចំនូលចិត្ត ក្តាម មឹក បង្គា លាស ងាវ បង្កងប៉ាក
                        - ហតដក
                        - ម្ទេសស្រស់ ម្ទេសក្រៀម
                        - ម្ទេសកូរ៉េ មានម្ទេសទឹក ម្ទេសហុយ
                        - ពោត ឬបន្លែផ្សេងទៀតតាមចំនូលចិត្ត
                        - ស្ករ អំបិល ទឹកត្រី ម្សៅស៊ុប ប្រេងខ្យង
                        - ទឹកដោះគោឆៅ
                        ''',
                        'Step': '''
                        1. បន្លែនឹងសាច់ត្រូវលាងអោយស្អាតជាមុនសិន ពោតត្រូ​វចំហុយអោយឆ្អិន
                        2. ខ្ទឹមបុកលាយជាមួយម្ទេសស្រស់អោយម៉ត់
                        3. ដាក់ខ្ទះអោយក្តៅ រួចហើយបំពង់ខ្ទឹមបុកអោយឆ្ងុយទើបដាក់ម្ទេសកូរ៉េទាំង2មុខចូល 
                        4. ម្ទេសហុយ1ស្លាបព្រាបាយ ម្ទេសទឹក2ស្លាបព្រាបាយ ឬលើសនេះតាមចំនូលចិត្ត
                        5. រួចដាក់ស្ករ ទឹកត្រី អំបិល ម្សៅស៊ុប ប្រេងខ្យង នឹងទឹកដោះគោឆៅចូល កូរអោយសព្វរួចភ្លក្សរសជាតិ
                        តាមការចូលចិត្តទើបដាក់ពោត ហតដក នឹងគ្រឿងសមុទ្រគ្រប់មុខចូល
                        6. រួចរាល់ហើយ បើសិនជាចូលចិត្តមី អាចដាក់ស្ពាហ្គាទីចូលទៀតក៏បាន
                        '''
                    }
                ]
            },
        ]
    },
    {
        'id': 5,
        'name': 'ខេត្ត សៀមរាប',
        'type': 'foodProvince',
        'image': 'https://th.bing.com/th/id/OIP.OcvIfYmnX_tVMrqAaMSYjwHaE_?rs=1&pid=ImgDetMain',
        'detail': [
            {
                'namey': 'ម្ហូប អាម៉ុក',
                'imagey': 'https://image.cookly.me/images/Siem-Reap-Food-Amok.cover.jpg',
                'information': [
                    {
                        'images': 'https://image.cookly.me/images/Siem-Reap-Food-Amok.cover.jpg',
                        'ingredient': '''
                        - ខ្យង 1 គីឡូក្រាម
                        - សាច់ជ្រូកបីជាន់ 1 ខាំ
                        - សណ្ដែកដី ម្ទេសឆ្អើរ ខ្ទិះដូង
                        - គ្រឿងបុក (រំដេង រមៀត ស្លឹកគ្រៃហាន់)
                        - កាពិ
                        - ប្រេងខ្យង
                        - គ្រាប់ជម្ពូឆាយកខ្ទិះ
                        - ស្លឹកកន្ទួត
                        - ស្លឹកក្រូចសើច
                        - ពង់មាន់
                        ''',
                        'Step': '''
                        1. យកសាច់ខ្យងចេញពី សំបករបស់វា ប៉ុន្តែត្រូវរក្សាសំបកទាំងនោះទុក កុំចោល។
                        2. ចិញ្ច្រាំសាច់ជ្រូក និងហាន់សាច់ខ្យងជាចំណិតតូចៗ។
                        3. បន្ទាប់មកយកសាច់ជ្រូកចិញ្ច្រាំនិងសាច់ខ្យងហាន់រួចនោះទៅឆាចូលគ្នាជាមួយនឹងគ្រឿងបុក, ម្ទេសឆ្អើរ, និងកាពិ រហូតដល់ឆ្អិនល្អ។
                        4. ជំហានបន្ទាប់ ត្រូវយកស្លឹកកន្ទួតទៅទ្រាប់សាច់ដែលឆាជាមួយគ្រឿងអម្បាញ់មិញ
                        5. រួចហើយយកទៅញាត់ចូលក្នុងសំបកខ្យងដែលរក្សាទុកនោះ។
                        6. ជំហានបន្ទាប់ ត្រូវចាក់ទឹកខ្ទិះដែលឆាបញ្ចូលគ្នាជាមួយពងមាន់ ម្ទេស និងស្លឹក ក្រូចសើច ទៅស្រោចពីលើខ្យង 
                        7. ដែលមានញាត់សាច់ទ្រាប់ស្លឹកកន្ទួតនោះ រួចហើយយកវាទៅចំហុយ ប្រហែលជា១៥នាទីទៀត ទើបរួចរាល់៕
                        ''',
                    }
                ]  
            },
            {
                'namey': 'ម្ហូប ការីខ្មែរ',
                'imagey': 'https://th.bing.com/th/id/OIP.Y9aE-WKX8CeN_QOkRGDSlgHaE7?rs=1&pid=ImgDetMain',
                'information': [
                    {
                        'images': 'https://th.bing.com/th/id/OIP.Y9aE-WKX8CeN_QOkRGDSlgHaE7?rs=1&pid=ImgDetMain',
                        'ingredient': '''
                        - មាន់ធំ 1ក្បាល ឆ្អឹងជំនីជ្រូក 1គីឡូ
                        - គ្រឿងបុក(ស្លឹកគ្រៃ រមៀត ខ្ជាយ រំដេង ខ្ទឹមស ខ្ទឹមក្រហម សម្បកក្រូចសើច) 1ត្បាល់ ប្រហែល1ចានចង្កឹះ
                        - គ្រឿងការីគ្រប់មុខ(ផ្កាចាន់ ឈើអែម ម្សៅការី ប្រេងគ្រាប់ការីក្រហម) មួយមុខបន្តិចៗ
                        - ម្ទេសឆ្អើរចិញ្ច្រាំ ប្រហែលកន្លះចានចង្កឹះ
                        - ស្លឹកក្រូចសើច 5-6សន្លឹក
                        - កាពិឆៅ 1ស្លាបព្រាបាយ
                        - ខ្ទិះដូងដើម 300g ឬប្រើដូង1ផ្លែ ឬមួយចំហៀងតាមចំនូលចិត្ត
                        - បន្លែការីគ្រប់មុខ(ដំឡូងបារាំង ឬដំឡូងជ្វា ខ្ទឹមបារាំង សណ្តែកកួរ ត្រប់វែង)មួយមុខបន្តិច
                        - សណ្តែកដីលីង (មិនដាក់ក៏បាន)
                        - អំបិល កន្លះស្លាបព្រាបាយ
                        - ទឹកត្រី 3ស្លាបព្រាបាយ
                        - ស្ករត្នោត4-5 ស្លាបព្រាបាយ
                        - ប្រេងខ្យង 2-3ស្លាបព្រាកាហ្វេ
                        - ម្សៅស៊ុប 1ស្លាបព្រាបាយ
                        - ទឹកធម្មតា 2លីត្រ ឬប្រើខ្ទិះដូងចុងជំនួសក៏បាន
                        ''',
                        'Step': '''
                        1. សាច់និងបន្លែលាងទឹកអោយស្អាត។ សាច់កាប់ជាដុំៗ ចំណែកបន្លែវិញកុំហាន់តូចពេក 
                        ព្រោះវានឹងរលួយអស់ តំឡូងកាប់ធំៗល្មម រួចទុកមួយឡែកសិន
                        2. ចំពោះដូងបងប្អូនប្រើមួយផ្លែក៏បានបើសិនជាចូលចិត្តញ៉ាំសម្លបែបចាស់គ្រឿង តែបើដាក់ខ្ទិះច្រើនឆ្ងាញ់ខ្លាំងណាស់។ 
                        ដូង1ពូតយកទឹកតែ2ទេ ខ្ទិះដើមយកខ្ទិះសុទ្ធ​។ រូចហើយច្របាច់ខ្ទិះបន្ទាប់ដាក់ទឹកប្រហែល2លីត្រ។
                        ច្របាច់2-3ដងក៏បានដើម្បីអោយអស់ខ្ទិះ (កុំភ្លេចត្រូវប្រទឹកក្តោអ៊ុនៗ)
                        3. ផ្កាចាន់នឹងឈើឯមត្រូវលីងអោយឈ្ងុយជាមុនសិន
                        4. ដាំឆ្នាំងឲ្យក្តៅ ចាក់ខ្ទិះដូងដើមចូល កូរវាអោយឈ្ងុយហើយឡើងប្រេង ទើបដាក់កាពិមួយស្លាបព្រាបាយចូល 
                        កូរវាអោយរលាយសព្វសាច់ជាមួយខ្ទិះដូង រួចដាក់ស្ករត្នោតចូល។ កូរអោយស្ករត្នោតឡើងក្រហមជើងអង្ក្រង
                        5. បន្ទាប់មកត្រូវចាក់គ្រឿងបុក ស្លឹកក្រូចសើច គ្រឿងការីនឹងផ្កាចាន់ដែលយើងលីងហើយចូល គូរវាអោយសព្វបើស្ងួតឆ្នាំង
                        ពេកថែមខ្ទិះចុងចូលបន្តិច កុំអោយវាខ្លោច។ កូរវាអោយពុះហើយឈ្ងុយ
                        6. ដាក់គ្រឿងផ្សំចូលមានដូចជា ទឹកត្រី ម្សៅស៊ុប ប្រេងខ្យង នឹងអំបិល កូរអោយសព្វហើយមានក្លិនឈ្ងុយ
                        7. ភ្លក្សរសជាតិតាមចំនូលចិត្ត តែសម្លការីត្រូវប្រើគ្រឿងអោយចាស់ទើបឆ្ងាញ់
                        8. ទើបចាក់សាច់ចូលតាមក្រោយ កូរសាច់អោយសព្វជាមួយគ្រឿង រំងាស់ប្រហែល 15-20នាទីសិន 
                        ទើបចាក់ខ្ទិះដូងទីពីរចូលអោយល្មមលិចសាច់ (ថែមទឹកម្តងពីរដង)។ មើលតែសាច់ល្មមផុយហើយទើបយើងចាក់តំឡូងជ្វានឹងតំឡូងបារាំងចូល
                        9. រំងាស់តំឡូងប្រហែល 5នាទីសិន មុនដាក់ខ្ទឹមបារាំង សណ្តែកគួរ នឹងត្រប់ចូល រំងាស់ថែម5នាទីទៀតជាការស្រេច
                        10. ស្លដាក់គ្រឿងអោយចាស់ហើយញ៉ាំជាមួយនំបញ្ចុកឬនំប៉័ងកាន់តែឆ្ងាញ់
                        ''',
                    }
                ]
            },
            {
                'namey': 'ម្ហូប នំបញ្ចុកខ្មែរ',
                'imagey': 'https://www.thidaskitchen.com/wp-content/uploads/2022/12/Nom-Banh-Chok.jpg',
                'information': [
                    {
                        'images': 'https://www.thidaskitchen.com/wp-content/uploads/2022/12/Nom-Banh-Chok.jpg',
                        'ingredient': '''
                        - ត្រីផ្ទក់ 1គីឡូ
                        - នំបញ្ចុក
                        - គល់ស្លឹកគ្រៃ ស្លឹកគ្រៃ រមៀត ខ្ចាយ រំដេង ស្លឹកក្រូចសើច ខ្ទឹមស ខ្ទឹមក្រហម
                        - ប្រហុក
                        - ស្ករ អំបិល ទឹកត្រី ម្សៅស៊ុប
                        - បន្លែគ្រប់មុខ តាមចំនូលចិត្ត
                        - ម្ទេសស្រស់ឬម្ទេសហុយ
                        ''',
                        'Step': '''
                        1. លាងត្រី នឹងបន្លែអោយស្អាតរួចទុកមួយឡែកសិន
                        2. ដាក់ដាំទឺកកន្លះឆ្នាំងដើម្បីស្ងោរត្រី ក្នុងទឹកត្រូវបង់ស្លឹកគ្រៃ 3-4សន្លឹក(បត់ចងវាអោយខ្លីហើយញីវាអោយចេញក្លិនឈ្ងុយ) 
                        ដាក់អំបិលនឹងស្ករបន្តិចផង ដើម្បីអោយសាច់ត្រីមានជាតិ
                        3. ដាក់ត្រីស្ងោរអោយឆ្អិន រួចស្រង់មកបេះយកតែសាច់
                        4. បុកគ្រឿងមានដូចជា គល់ស្លឹកគ្រៃ រមៀត ខ្ចាយ រំដេង ស្លឹកក្រូចសើច ខ្ទឹមស ខ្ទឹមក្រហម អោយម៉ត់
                        5. បន្ទាប់មកដាក់សាច់ត្រីដែលបេះហើយចូល
                        6. បុកសាច់ត្រីអោយម៉ត់ជាមួយគ្រឿង
                        7. យកទឹកដែលសល់ពីស្ងោរត្រីមកដាំអោយពុះម្តងទៀត (ថែមទឹកអោយល្មមសមជាមួយនំបញ្ចុក)
                        8. ពេលទឹកពុះដាក់ជ្រុំប្រហុក (ដាក់ប្រហុកអោយច្រើនបន្តិចទើបឆ្ងាញ់ខ្លាំងៗ)
                        9. ចុងក្រោយដាក់សាច់ត្រីដែលបុកជាមួយគ្រឿងចូល
                        10. ភ្លក្សរសជាតិតាមចំនូលចិត្ត រួចបិទភ្លើង (មិនចាំបាច់ទុកអោយពុះយូទេ)
                        11. បន្លែល្ហុង ត្រយ៉ូងចេក ត្រសក់ ស្លឹកល្ងៀង ផ្កាស្នោរ មិនគួរចោលទេ ដាក់បន្លែកាន់តែច្រើនកាន់តែឆ្ងាញ់
                        ''',
                    }
                ]
            },
        ]
    },
    {
        'id': 6,
        'name': 'ខេត្ត ស្វាយរៀង',
        'type': 'foodProvince',
        'image': 'https://www.aboutcambodiatravel.com/uploads/images/content_image/Svay%20Rieng/Svay%20Rieng-ACT%20Cambodia%20Tours.jpg',
        'detail': [
            {
                'namey': 'ម្ហូប បុកល្ហុងគ្រឿងសមុទ្រ',
                'imagey': 'https://i.ytimg.com/vi/jibv2v8Y5NY/maxresdefault.jpg',
                'information': [
                    {
                        'images': 'https://i.ytimg.com/vi/jibv2v8Y5NY/maxresdefault.jpg',
                        'ingredient': '''
                        ខ្ទឹមស 4 កំពិស
                        ក្តាមសេះស្រស់ កាត់ជាចំរៀកៗ
                        ប៉េងប៉ោះ ហាន់តូចល្មម
                        សណ្តែកគួ កាត់ប្រវែងមួយថ្នាំងដៃ
                        ត្រកួន ជ្រៀកជាសរសៃ
                        ល្ហុងខ្ចី ឈូសជាសរសៃ
                        ទឹកផ្សំរសជាតិ 1 ស្លាបព្រាបាយ (កាពិ ទឹកម្ទេស អំពិលទុំ ឆាចូលគ្នា)
                        ទឹកត្រី 2 ស្លាបព្រាបាយ
                        សណ្តែកដីលីង 1 ស្លាបព្រាបាយ
                        ទឹកក្រូចឆ្មា 1 ស្លាបព្រាបាយ
                        ស្ករស 1 ស្លាបព្រាបាយ
                        បង្គារគ្រៀម 1 ស្លាបព្រាបាយ
                        ម្ទេស
                        ''',
                        'Step': '''
                        បុកខ្ទឹម និងម្ទេសអោយបែកបន្តិច ដាក់បង្គារបុកជាមួយពីរបីដង រួចដាក់សណ្តែកដី និងគ្រឿងផ្សំរសជាតិដូចជា ទឹកត្រី ប៊ីចេង ស្ករ ក្រូចឆ្មារ ទឹកកាពិ និងក្តាមបុកតិចៗ អោយចូលជាតិ (កុំអោយបែកក្តាម)។
                        ដាក់ល្ហុង ត្រកួន និងសណ្តែកគួចូលបុកជាមួយគ្នាតិចៗ។
                        ដាក់ ប៉េងប៉ោះ និងជី ចូលកូអោយសព្វ ជាការស្រេច៕
                        ដាក់ម្ទេសកាន់តែហឹរ កាន់តែឆ្ងាញ់។
                        ''',
                    }
                ]  
            },
            {
                'namey': 'ម្ហូប ជ្រក់ជើងមាន់',
                'imagey': 'https://i.ytimg.com/vi/4RYpMfvK1S0/maxresdefault.jpg',
                'information': [
                    {
                        'images': 'https://i.ytimg.com/vi/4RYpMfvK1S0/maxresdefault.jpg',
                        'ingredient': '''
                        ជើងមាន់ (កន្លះគីឡូក្រាម)
                        គល់ស្លឹកគ្រៃ ៦គល់ (កាត់ខ្លីៗ ដំអោយបែក)
                        ស្ករស (1 ស្លាបព្រាបាយ)
                        អំបិល (3 ស្លាបព្រាកាហ្វេ)
                        ខ្ញី (1 ខាំ) (ហាន់ជាបន្ទះស្តើងៗ)
                        ទឹកត្រី (1 កូនចានចង្កឹះ)
                        ទឹកខ្មេះ (កន្លះកូនចានចង្កឹះ)
                        ទឹក (2 កូនចានចង្កឹះ)
                        ម្ទេស (តាមចំនូលចិត្ត) (ហាន់ប្រឆិតៗស្តើងៗ ឬ ដាក់ទាំងមូល)
                        ស្លឹកក្រូច (5 សន្លឹក) (ហាន់ជាសរសៃស្តើងៗ)
                        ខ្ទឹមស (ហាន់ជាចំណិតស្តើងៗ)
                        ក្រូច (សម្រាប់ធ្វើតែក្រូចឆ្មា) (10ផ្លែ) (ពុះជាពីរ)
                        ''',
                        'Step': '''
                        យកជើងមាន់លាងទឹកអោយស្អាត កាត់ក្រចកចេញ រួចកាត់ជាពីរ
                        ដាក់ជើងមាន់ក្នុងឆ្នាំង ដាក់អំបិល 2 ស្លាបព្រាកាហ្វេ ស្ករបន្តិច គល់ស្លឹកគ្រៃ 2-3 ចំណិត ខ្ញី 3-4 ចំណិត និងទឹកចូលគ្នារួចដាក់ដាំរហូតដល់ជើងមាន់ឆ្អឹនល្អ (ក្នុងអំឡុងពេលនោះ ឧស្សាហ៍ដួសពពុះចោល) ប្រហែលជា 5 នាទី
                        ដួសជើងមាន់ដែលស្ងោឆ្អឹនដាក់ចូលក្នុងចានទឹកកកប្រហែលជា 20 នាទី
                        លាយទឹកត្រី ស្ករស 1 ស្លាបព្រាបាយ ទឹកខ្មេះ ទឹក និងអំបិល 1 ស្លាបព្រាកាហ្វេចូលគ្នា រួចដាំអោយពុះ
                        ស្រង់ជើងមាន់ដាក់ក្នុងកែវមានគំរប ដាក់គល់ស្លឹកគ្រៃ ដែលនៅសល់ចូល ដាក់ម្ទេស ស្លឹកក្រូចសើច ខ្ទឹមស ខ្ញី និងទឹកត្រីដែលដាំរួចចូល រួចគ្របអោយជិតទុកមួយថ្ងៃអាចញុំាបានជាការស្រេច
                        ញុំាជាមួយអំបិលម្រេចកាន់តែឆ្ងាញ់។
                        ''',
                    }
                ]  
            },
            {
                'namey': 'ម្ហូប ជ្រក់ជើងទា',
                'imagey': 'https://images.khmer24.co/22-08-02/235642---1659415332-41292179-b.jpg',
                'information': [
                    {
                        'images': 'https://images.khmer24.co/22-08-02/235642---1659415332-41292179-b.jpg',
                        'ingredient': '''
                        ស្លាបមាន់ កន្លះគីឡូ
                        ទឹកស៊ីអ៉ីវ 2 ស្លាបព្រាបាយ
                        ទឹកប្រេងខ្យង 2 ស្លាបព្រាបាយ
                        ស្ករ កន្លះស្លាបព្រាបាយលើស
                        ខ្ទឹមស 2 កំពឹស
                        ម្រេច (តាមចំណូលចិត្ត)
                        ជ្រក់ស្ពៃ ឬ គីមឈី
                        ជ្រក់ស្ពៃ 1 កូនចាន
                        ជ្រក់ស្ពៃ 1 កូនចាន
                        ម្ទេស
                        ខ្ទឹមក្រហម + ខ្ទឹមស
                        ស្ករ 1 ស្លាបព្រាកាហ្វេ
                        ទឹកត្រី 1 ស្លាបព្រាបាយ
                        ''',
                        'Step': '''
                        ជាដំបូងត្រូវប្រឡាក់ស្លាបមាន់ជាមួយទឹកសុីអុីវ ទឹកប្រេងខ្យង ស្ករ ខ្ទឹមសចិញ្ច្រាំ និងម្រេច រួចទុកចោលរយៈពេល 30 នាទីដើម្បីឲ្យវាចូលជាតិល្អ។
                        ពេលស្លាបមាន់ចូលជាតិហើយ យើងអាចយកវាទៅចៀន ឬអាំងក៏បាន រយៈពេល 10 នាទីរហូតទាល់តែឆ្អិនល្អ។
                        ហាន់ស្ពៃជ្រក់ជាសសៃតូចៗ លាយជាមួយម្ទេស ខ្ទឹមស ខ្ទឹមក្រហម រួចដាក់ស្ករ ទឹកត្រី ហើយច្របាច់ចូលគ្នាឲ្យសព្ធ ដើម្បីបានរសជាតិប្រៃជូរអែម។
                        ពេលស្លាបមាន់ឆ្អិនហើយ ចាប់វាដាក់ចាន អ្នកអាចផ្ទាប់ញាំជាមួយជ្រក់ស្ពៃបានហើយ។
                        ''',
                    }
                ]  
            },
        ]
    },
    {
        'id': 7,
        'name': 'ខេត្ត ព្រៃវែង',
        'type': 'foodProvince',
        'image': 'https://th.bing.com/th/id/R.8dc11aaa362bb45cdb179db6e6b96c69?rik=IeSVOfBSsVNi2A&riu=http%3a%2f%2fcambodia.thajsko.com%2fwp-content%2fuploads%2fPrey-Veng-01.jpg&ehk=0OkoZNssftcBhyuW2hvC3%2bOGOsqrIjDKpyMRKIWjdcA%3d&risl=&pid=ImgRaw&r=0',
        'detail': [
            {
                'namey': 'ម្ហូប គោដុត',
                'imagey': 'https://i.ytimg.com/vi/rU2kBIg4G_E/maxresdefault.jpg',
                'information': [
                    {
                        'images': 'https://i.ytimg.com/vi/rU2kBIg4G_E/maxresdefault.jpg',
                        'ingredient': '''
                        សាច់គោ
                        ម្រេច ទឹកត្រី
                        អង្ករលីង ស្ករសរ
                        ម្ទេសហុយ ទឹកក្រូចឆ្មារ
                        ខ្ទឹមក្រហម ខ្ទឹមបារាំង ជីអង្កាម
                        ''',
                        'Step': '''
                        យកសាច់គោប្រឡាក់ជាមួយម្រេច និង ទឹកត្រី ហើយផ្អាប់ទុកប្រហែលមួយម៉ោង
                        អាំងសាច់គោដែលបានប្រឡាក់រួចជាមួយភ្លើងក្តៅល្មប្រហែល ៨ នាទី រួចប្រែម្ខាងទៀត (វាអាស្រ័យទៅលើកំរាស់សាច់របស់យើង) រហូតទាល់តែសាច់របស់យើងឆ្អិនល្មម (កុំឆ្អិនខ្លាំងពេក)
                        ពេលដែលអាំងសាច់គោរួចហើយ លើកដាក់ចានទុកអោយត្រជាក់ប្រហែល ៥ ទៅ ១០ នាទី ដើម្បីអោយវាបញ្ចេញជាតិទឹករបស់សាច់គោ
                        ហាន់សាច់គោជាបន្ទះវែងៗដែលអាចដាក់ចូលក្នុងមាត់បាន
                        ប្រើចានធំមួយដើម្បីលាយសាច់គោដែលបានហាន់ហើយ ជាមួយខ្ទឹមក្រហម និងខ្ទឹមបារាំង (មិនមែនដាក់ខ្ទឹមទាំងមូលទេហាន់វាតូចៗ ស្តើងៗដាក់ទាំងឆៅ)
                        រួចដាក់ជីអង្កាម អង្ករលីង ទឹកត្រី ស្ករសរ ម្ទេសហុយ ទឹកក្រូចឆ្មារ រួចច្របល់ចូលគ្នាអោយសព្វ (ប្រើដៃក៏បានបើញាំខ្លួនឯង) កុំភ្លេចស្រោចទឹកសាច់គោដែលស្រក់ចេញពីសាច់អាំងរបស់យើង។
                        ម្ហូបនេះគួរតែមានរសជាតិ ជូរ ប្រៃ និងហឺរ
                        ដួសដាក់ចានហើយក្លែមជាមួយស្រាបៀរកាន់តែពិសេស
                        ''',
                    }
                ]  
            },
            {
                'namey': 'ម្ហូប កង្កែបបោក',
                'imagey': 'https://i.ytimg.com/vi/pVyG9ecRsdg/maxresdefault.jpg',
                'information': [
                    {
                        'images': 'https://i.ytimg.com/vi/pVyG9ecRsdg/maxresdefault.jpg',
                        'ingredient': '''
                        កង្កែប 3គីឡូ
                        សាច់ជ្រូកបីជាន់ កន្លះគីឡូ
                        គ្រឿងបុក 1ចានចង្កឹះ មានដូចជា គល់ស្លឹកគ្រៃ រមៀត ម្តេង ខ្ទឹមស ស្លឹកក្រូចសើច
                        ខ្ទឹមក្រហម 4ដុំ ហាន់ស្តើងៗ
                        ខ្ទឹមស 1០កំពឹស ចិញ្រ្ចាំអោយល្អិត
                        ទឹកត្រី 2ស្លាបព្រាបាយ
                        ស៊ុបមាន់ 2ស្លាបព្រាបាយ
                        អំបិល កន្លះស្លាបព្រាបាយ
                        ស្ករ 2ស្លាបព្រាបាយ
                        ម្សៅអំពិល 1ស្លាបព្រាបាយ (អត់ក៏បានតាមចំនូលចិត្ត)
                        ម្ទេស 15គ្រាប់ (តាមចំនូលចិត្ត) ហាន់ល្អិតៗ
                        ស្លឹកក្រូចសើច 10សន្លឹក ហាន់ជាសរសៃតូចៗ
                        ម្រះព្រៅ​ តិចច្រើនតាមចំនូលចិត្ត
                        ''',
                        'Step': '''
                        លាងកង្កែបអោយស្អាត កាត់ជើងចេញទុកត្រឹមភ្លៅ រួចយកទៅប្រលាក់គ្រឿងមួយមុខបន្តិចៗ ដែរមានដូចជា(ទឹកត្រី អំបិល ស្ករ ស៊ុបមាន់) ទុកមួយឡែក
                        ចិញ្រ្ចាំសាច់ជ្រូក និងជើងកង្កែប (កុំម៉ដ្ធពេក) រូចដាក់ ម្ទេស ខ្ទឹមស ខ្ទឹមក្រហម ស្លឹកក្រូច ចិញ្រ្ចាំចូលគ្នា
                        ដាក់គ្រឿងផ្សំដែលនៅសល់ទាំងអស់ និងសាច់ខាងលើ ច្របល់ចូលគ្នាអោយសព្វ រួចហាន់ម្រះព្រៅដាក់ ច្របល់ចូលគ្នាអោយសព្វម្តងទៀត
                        បន្ទាប់មកយកសាច់ដែរលាយគ្រឿងរួចទៅញាត់ចូលក្នុងកង្កែបអោយពេញ (កុំណែនពេក)
                        យកកង្កែបបោកទៅអាំងដោយប្រើកំដៅតិចៗ រហូតដល់ឆ្អិនល្អរួចជាការស្រេច
                        បងប្អូនក៏អាចញាំវាជាមួយអំពិលបុក រឺក៏ក្រសាំងបុកក៏បាន នោះពិតជាឆ្ងាញ់ខ្លាំងមែនទែន
                        ''',
                    }
                ]  
            },
            {
                'namey': 'ម្ហូប មាន់ដុត',
                'imagey': 'https://i.ytimg.com/vi/ReEGyYimDQU/maxresdefault.jpg',
                'information': [
                    {
                        'images': 'https://i.ytimg.com/vi/ReEGyYimDQU/maxresdefault.jpg',
                        'ingredient': '''
                         មាន់ស្រែមួយក្បាល
                        ខ្ទឹមសរ ខ្ទឹមក្រហម
                        ម្រេច ទឹកសុីអុីវ
                        ម្សៅស៊ុបរ៉ូឌី
                        ប្រេងល្ង ប្រេងខ្យង
                        គល់ស្លឹកគ្រៃ រំដេង ស្លឹកក្រូចសេីច
                        ''',
                        'Step': '''
                        មាន់ស្រែមួយក្បាល មាន់ស្រែមួយក្បាល
                        ខ្ទឹមសរ ខ្ទឹមក្រហម ម្រេច ទឹកសុីអុីវ ម្សៅស៊ុបរ៉ូឌី ប្រេងល្ង ប្រេងខ្យង បុកបញ្ចូលគ្នារួចយកទៅប្រឡាក់សាច់មាន់ទុករយះពេល 15នាទីសិន ទេីបយកទៅដុត
                        យកឆ្នាំងធំមួយ ក្រាលបាតឆ្នាំង ដាក់គល់ស្លឹកគ្រៃ រំដេង ស្លឹកក្រូចសេីច ខ្ទឹមសរ ខ្ទឹមក្រហម
                        ចាក់ប្រេងឆារបន្តិច បេីកភ្លេីងអោយក្ដៅឆ្នាំង
                        ដាក់មាន់ចូល ចាក់កូកាកូឡាចូលពាក់កណ្ដាលកំប៉ុងសិនរួចបេីកភ្លេីងតិចៗ អោយសាច់មាន់ឆ្អិនល្អ ហេីយឡេីងក្រហមគួរអោយចង់បរិភោគ
                        (បេីសាច់មាន់មិនទាន់ឆ្អិនល្អបន្ថែមកូកាកូឡាដែលនៅសល់នោះអោយអស់រួចបន្តរការប្រែមាន់ពីង្ខាងទៅង្ខាងទៀត ទេីបសាច់មាន់ឆ្អិនល្អហេីយក្រហមសព្វ)
                        យេីងអាចញុំជាមួយទឹកម្រេចក្រូចឆ្មារ ឬ ទឹកត្រីបុកក៏បាន
                        ''',
                    }
                ] 
            },
        ]
    },
    {
        'id': 8,
        'name': 'ខេត្ត ក្រចេះ',
        'type': 'foodProvince',
        'image': 'https://www.travel4history.com/wp-content/uploads/2020/01/Kratie-travel-guide-kampi.jpg',
        'detail': [
            {
                'namey': 'ម្ហូប ទាដុត',
                'imagey': 'https://images.deliveryhero.io/image/fd-kh/LH/bxk5-hero.jpg',
                'information': [
                    {
                        'images': 'https://images.deliveryhero.io/image/fd-kh/LH/bxk5-hero.jpg',
                        'ingredient': '''
                        ទាសំពៅ 1 ក្បាល
                        ស្រាអង្ករ 1 ពែង
                        ទឹកឃ្មុំ 1 ស្លាបព្រាបាយ
                        អំបិល 1 ស្លាបព្រាកាហ្វេ
                        ម្រេច 1 ស្លាបព្រាកាហ្វេ
                        ម្ទេស 2 ផ្លែ (បុកអោយម៉ត់)
                        ខ្ទឹមស 4 កំពិសចិញ្រ្ចាំអោយម៉ត់
                        ទឹកឈីអ៊ីវ 1 ស្លាបព្រាបាយ
                        ប្រេងខ្យង 1 ស្លាបព្រាបាយ
                        ម្សៅស៊ុប 1 ស្លាបព្រាបាយ
                        ប្រេងឆា 1 ស្លាបព្រាបាយ
                        ''',
                        'Step': '''
                        លាងសំអាតទាអោយស្អាត(ពុះខ្នង ឬ ជាបំនែក) យកស្រាអង្ករ លាបអោយសព្វ ទុកវាមួយឡែកយ៉ាងហោចណាស់មួយម៉ោង។
                        បុកម្រេចអោយម៉ត់ដាក់ក្នុងចានធំមួយ (សម្រាប់ប្រលាក់) ដាក់អំបិល ខ្ទឹមសទឹកឈីអ៊ីវ ប្រេងខ្យង ប្រេងឆា ទឹកឃ្មុំ អំបិល ម្ទេស ច្របល់ចូលគ្នាសព្វ ។
                        យកទាប្រលាក់ជាមួយគ្រឿងផ្សំដែលបានលាយរួចអោយចូលជាតិ។ ទុកវាចោលមួយម៉ោងទៀត។
                        យកទាដែលប្រលាក់ រុំ ជាមួយ ក្រដាស់អាលុយមីញ៉ូម (ដាក់ទាំងទឹកដែលចេញពីការប្រលាក់ទាចូលផង)។ រូចយកទៅដុតក្នុង oven ក្នុងកំដៅ 400c រយៈពេលប្រហែល 30 នាទី។
                        បន្ទាប់មកយកទាចេញពី oven ហើយដាក់អាំងអោយក្រហមល្អ ប្រហែលជា 30 នាទី ជាការស្រេច។
                        ''',
                    }
                ] 
            },
            {
                'namey': 'ម្ហូប ខជើងជ្រូក',
                'imagey': 'https://i.ytimg.com/vi/x5x8Xjg3ZTw/maxresdefault.jpg',
                'information': [
                    {
                        'images': 'https://i.ytimg.com/vi/x5x8Xjg3ZTw/maxresdefault.jpg',
                        'ingredient': '''
                        ដាំទឹកស្ងោរជើងជ្រូក អោយពុះទន់ស្បែកបន្តិច ទើបស្រង់ យកទៅខ។ (ធ្វើបែបនេះ ទឹកខ មិនសូវមានជ័រខាប់ ដែលនាំអោយឆាប់ផ្អូម)
                        របៀបខ ៖ កម្លោចស្ករត្នោត អោយក្រហម ហើយ ដាក់ទឹកត្រី អំបិល ផ្កាចាន់ និង ម្រេចបុក តែកុំដាក់ខ្ទឹមស នាំអោយឆាប់ផ្អូម។
                        អាចដាក់ ពងទាស្ងោរឆ្អិន បកអោយស្អាត ដាក់ ខជាមួយផងក៏បាន។
                        បើចង់ប្លែក ដាក់ទំពាំងហាល ខជាមួយក៏បាន ឬដាក់ទំពាំងស្ងោរបន្សាប រួចហើយ ខជៃមួយក៏បាន។
                        ឬចង់ដាក់ផ្សិត ខជាមួយក៏បាន តាមចំណូលចិត្ត។
                        ''',
                    }
                ] 
            },
            {
                'namey': 'ម្ហូប ស៊ុបមាន់ខ្មៅ',
                'imagey': 'https://i.pinimg.com/originals/2f/25/73/2f2573a95ba22504864b81187e960e00.jpg',
                'information': [
                    {
                        'images': 'https://i.pinimg.com/originals/2f/25/73/2f2573a95ba22504864b81187e960e00.jpg',
                        'ingredient': '''
                        មាន់ខ្មៅ
                        គ្រឿងថ្នាំចិនសែរស្ងោរមាន់ ១ កញ្ចប់
                        មើមខ្ញី ខ្ទឹមស
                        អំបិល ទឹកត្រី ស្ករ ម្សៅស៊ុប
                        ''',
                        'Step': '''
                        ដាំទឹកឲ្យពុះ ស្ងោរមាន់ខ្មៅ មួយពុះចោល ឲ្យបាត់ជាតិចំអាប ស្រង់ចេញ ទុកទៅម្ខាង
                        លីងខ្ទឹមសឲ្យឈ្ងុយ រួចចាក់ទឹកត្រីចូល អំបិល និងស្ករ កូរឲ្យឈ្ងុយ ទើបចាក់ទឹកចូលដាំឲ្យពុះ
                        ពេលទឹកពុះ ដាំមើមខ្ញីដាក់មួយដុំ ហើយដាក់មាន់ ដាក់ថ្នាំចិនចូល ដាក់រំងាស់ កុំគ្របគម្របឆ្នាំង (បើគ្របនឹងធ្វើឲ្យទឹកស្ងោរល្អក់ ហើយឆាប់ផ្អូម)
                        នៅពេលមាន់ផុយទន់សាច់ ទើបដាក់ម្សៅស៊ុប ហើយភ្លក្សថែមថយតាមចំណូលចិត្ត ជាការស្រេច។
                        (ស៊ុបនេះត្រូវទទួលទាននៅពេលក្តៅៗទើបឆ្ងាញ់)
                        ''',
                    }
                ] 
            },
        ]
    },
    {
        'id': 9,
        'name': 'ខេត្ត កំពង់ស្ពឺ',
        'type': 'foodProvince',
        'image': 'https://i.ytimg.com/vi/1KopaSG9v_g/maxresdefault.jpg',
        'detail': [
            {
                'namey': 'ម្ហូប ញាំស្ពៅ',
                'imagey': 'https://i.ytimg.com/vi/AFB3VGXhPjU/maxresdefault.jpg',
                'information': [
                    {
                        'images': 'https://i.ytimg.com/vi/AFB3VGXhPjU/maxresdefault.jpg',
                        'ingredient': '''
                        ត្រីឆ្អើរ (បើបានត្រីអណ្តែងកាន់តែពិសេសពីព្រោះវាមានសាច់ច្រើន)
                        ស្វាយខ្ចី១ផ្លែ
                        បង្គារក្រៀម
                        សណ្តែកដីលីង
                        ខ្ទឹមស ខ្ទឹមក្រហម (បើមាន)
                        ស្ករស ទឹកត្រី
                        ម្ទេស
                        ''',
                        'Step': '''
                        បេះត្រីឆ្អើរជាចំណិតតូចៗ
                        ចិតសំបកស្វាយ រួចសាប់ជាសសៃៗ ឬ ឈូសជាសសៃៗក៏បាន។
                        បុកបង្គារក្រៀម បុកសណ្តែកដីលីង បុកខ្ទឹមស ហាន់ខ្ទឹមក្រហមស្តើងៗ
                        ដាក់ត្រីឆ្អើរ ស្វាយ បង្គារក្រៀម សណ្តែកដីលីង ខ្ទឹមស ខ្ទឹមក្រហមចូលគ្នា ម្ទេស ចាក់ទឹកត្រី ដាក់ស្ករស រួចច្របល់ចូលគ្នា ភ្លក់រសជាតិដែលអ្នកចូលចិត្តជាការស្រេច។
                        ចំណាំ៖ អាចដាក់បន្លែដូចជា ស្ពៃក្តោប និងជីក៏បានតាមការចូលចិត្ត ចំពោះស្វាយខ្ចីកុំយកស្វាយដែលជូរពេក ។
                        ''',
                    }
                ] 
            },
            {
                'namey': 'ម្ហូប សម្លរកកូរ',
                'imagey': 'https://i.ytimg.com/vi/gyXkTNSBAG0/maxresdefault.jpg',
                'information': [
                    {
                        'images': 'https://i.ytimg.com/vi/gyXkTNSBAG0/maxresdefault.jpg',
                        'ingredient': '''
                        ត្រី
                        សាច់ជ្រូកបីជាន់
                        អង្ករលីង
                        ប្រហុកចិញ្ច្រាំ
                        គ្រឿងបុក មានដូចជាស្លឹកគ្រៃ ល្មៀត ខ្ជាយ ខ្ទឹមស
                        បន្លែកកូរ មានដូចជា ល្ហុងសាប់ សណ្តែកគួរ ល្ពៅ ត្រប់ ចេកខ្ចី ស្លឺកបាស់ ស្លឹកម្រុំ -ល-
                        ប្រេងឆា
                        ស្ករស
                        ម្សៅស៊ុប
                        អំបិល
                        ទឹកត្រី
                        ''',
                        'Step': '''
                        ធ្វើត្រីហើយលាងអោយស្អាតរួចកាត់ជាកង់ៗទុកមួយឡែកសិន
                        ដាក់ខ្ទះអោយក្ដៅ ហើយដាក់អង្ករប្រហែលជាមួយក្តាប់ចូល លីងវាអោយឡើងពណ៌ក្រហមបន្ទាប់មកយកទៅបុកឬកិនអោយម៉ត់
                        ស្លឹកគ្រៃ ល្មៀត ខ្ជាយ ត្រូវហាន់ស្ដើងៗ បន្ទាប់មកយកវាទៅបុកអោយល្អិតរួចដាក់ខ្ទឹមសចូលបុកអោយម៉ត់ ដួសវាទុកសិន
                        បន្លែគ្រប់មុខត្រូវលាងអោយស្អាត បងប្អូនអាចដាក់បន្លែដូចដែរខ្ញុំរៀបរាប់ខាងលើរឺដាក់លើសនេះក៏បាន ទៅតាមចំនូលចិត្ត
                        ល្ហុងជាមួយនឹងចេកខ្ចី ត្រូវសាប់វា ហើយឈូសស្តើងៗល្មម ចំណែកត្រប់ ល្ពៅកាត់ជាដុំៗ
                        ដាក់ឆ្នាំងចាក់ប្រេងឆាចូលទុកអោយក្ដៅ រួចដាក់ប្រហុកចិញ្ច្រាំចូល កូរអោយឈ្ងុយហើយចាក់គ្រឿងបុកចូល 
                        កូរគ្រឿងអោយឈ្ងុយម្តងទៀតហើយចាក់សាច់ជ្រូកបីជាន់នឹងត្រីចូល កុំបើកភ្លើងខ្លាំងពេក វាអាចធ្វើអោយខ្លោចបាតឆ្នាំង 
                        កូរវារហូតដល់ដាច់ទឹក រួចដាក់គ្រឿងផ្សំចូល មានដូចជា ទឹកត្រី ស្ករ អំបិល នឹងម្សៅស៊ុប។ កូរវាទៀត​រហូតដល់
                        គ្រឿងរលាយចូលសព្វជាមួយសាច់ បន្ទាប់មកដាក់អង្ករលីងចូលប្រហែល2ស្លាបព្រាបាយសិនបព្រោះបន្តិចទៀត
                        អង្ករប្រាកដជារីក កូរវាអោយចូលជាតិគ្នាហើយចាក់ទឹកចូល ទឹកដាក់អោយសមល្មម 
                        (ភ្លក្សរសជាតិអោយល្មមទៅតាមចំនូលចិត្ត) បិទគ្របឆ្នាំងហើយបើកភ្លើងអោយខ្លាំងរហូតសម្លរពុះ 
                        បន្ទាប់មកទៀតដាក់ល្ពៅ ត្រប់ល្ហុង សណ្តែកគួរ ចេកចូល។ទុកវាមួយពុះរួចហើយដាក់បន្លែស្លឹកផ្សេងៗចូល 
                        ទុកមួយពុះទៀតអោយបន្លែឆ្អិនល្អហើយបិទភ្លើង។
                        ''',
                    }
                ] 
            },
            {
                'namey': 'ម្ហូប សម្លរម្ជួរយួន',
                'imagey': 'https://th.bing.com/th/id/OIP.eLANz7XESVhf-V2TEXopiAHaEK?rs=1&pid=ImgDetMain',
                'information': [
                    {
                        'images': 'https://th.bing.com/th/id/OIP.eLANz7XESVhf-V2TEXopiAHaEK?rs=1&pid=ImgDetMain',
                        'ingredient': '''
                        សាច់មាន់ 400 ក្រាម ហាន់ជាដុំៗតូចល្មម
                        ខ្ទឹមស 6 កំពឹស(បំពងឲ្យឈ្ងុយ)
                        ម្អម 1 កូនដុំ ហាន់ឲ្យល្អិតៗ
                        ត្រឡាច 1 ផ្លែ (តូចល្មម) ចិតជាដុំតូចៗ
                        ប៉េងប៉ោះ 4 ផ្លែ (ចិតជា៤ចំណិត)
                        ស្លឹកខ្ទឹម 2 ដើម កាត់ជាកង់ៗ 2 ថ្នាំងដៃ
                        ផ្សិត 200 ក្រាមចិតជាចំណិតៗ
                        ម្នាស់ មួយចំហៀងកាត់ជាដុំៗ
                        ក្រអៅឈូក 5 ​ដើមកាត់កង់ៗ ប្រហែល 2 ថ្នាំងដៃ
                        ម្សៅស៊ុប 1 ស្លាបព្រាបាយ
                        ប៊ីចេង 2 ស្លាបព្រាកាហ្វេ
                        ទឹកត្រី​ 2 ស្លាបព្រាបាយ
                        ស្កសរ កន្លះស្លាបព្រាបាយ
                        អំបិល 1 ស្លាបព្រាកាហ្វេ
                        ពងទា 2 គ្រាប់
                        ''',
                        'Step': '''
                        ជា​ការ​ចាប់​ផ្តើម​អ្នក​ត្រូវ​ដាក់​ឆ្នាំង​ដាំ​ទឹក​ឲ្យ​ពុះ​ បន្ទាប់​មក​ទើប​អ្នក​ដាក់​សាច់​មាន់​ ​ចូល​រួច​ក៍​គ្រប​សិន​។
                        នៅ​ពេល​ដែល​ទឹក​ពុះ​អ្នក​ត្រូវ​ដាក់​ម្នាស់​,ត្រឡាច​ និង​ប៉េង​ប៉ោះ​រួច​ហើយ​ក៍​គ្របម្តង​ទៀត​។​
                        នៅ​ពេល​ដែល​ទឹក​ពុះ​ម្តង​ទៀត​ត្រូវ​ដាក់​ផ្សិត,ទឹកត្រី​, ស្កសរ​, អំបិល, ប៊ីចេង​ ​ម្សៅ​ស៊ុប​ ក្រអៅឈូក​, 
                        ស៊ុត ​និង​ខ្ទឹម​បំពង​គ្រប​មួយ​សន្ទុះ​ប្រហែល​ជា​ 
                        10-15 នាទី​ចាំ​អ្នក​បង់​ម្អម​ចូល​ជា​ការ​ស្រេច។​
                        ''',
                    }
                ] 
            },
        ]
    },
    {
        'id': 10,
        'name': 'ខេត្ត កំពងចាម',
        'type': 'foodProvince',
        'image': 'https://thumbs.dreamstime.com/b/preah-soramrit-kosamak-kirirom-national-park-mountain-oamrei-phong-village-commune-phnom-sruoch-district-kilometers-118549110.jpg',
        'detail': [
            {
                'namey': 'ម្ហូប បុកមី',
                'imagey': 'https://i.ytimg.com/vi/Dct2agFefUM/maxresdefault.jpg',
                'information': [
                    {
                        'images': 'https://i.ytimg.com/vi/Dct2agFefUM/maxresdefault.jpg',
                        'ingredient': '''
                        -មីវៃវៃ
                        -ប៉េងប៉ោះ
                        -សណ្តែកគួ
                        -ត្រកួន
                        -សណ្តែកដីលីង
                        -ក្រូចឆ្មា
                        -ម្ទេស
                        -ជីរណា
                        -អំបិល
                        -ស្ករ
                        -ម្សៅស៊ុប
                        ''',
                        'Step': '''
                        ទី1: យកមីវៃវៃ​ទៅស្រុះទឹកក្តៅ​ រួចទុកមួយអន្លើ​សិន ច្រូចប្រេងឆាបន្តិចកុំអោយសសៃមីស្អិតជាប់គ្នា
                        ទ2: ត្រកួនច្រៀកជាសសៃ​ៗ​ រួចយកទៅត្រាំទឹកកក​ ឬទឹកធម្មតាក៏បាន​
                        ទី3: បុកសណ្តែកគួ​ ប៉េងប៉ោះ​ និងម្ទេស​ រួចដាក់​ ជីរណា,ត្រកួន,ក្រូចឆ្មា,សណ្តែកដីលីង,
                        អំបិល,ស្ករ​ និងម្សៅស៊ុប​ (សណ្តែកដីលីងកុំបុកម៉ត់ពេក​ អោយតែបែកៗទៅបានហើយ)។
                        ទី4: ដួសដាក់ចានជាការស្រេច
                        ''',
                    }
                ] 
            },
            {
                'namey': 'ម្ហូប ឆាក្តៅទា',
                'imagey': 'https://th.bing.com/th/id/OIP.hfXuuTYeAoI4aIO5mrjjEgHaEK?rs=1&pid=ImgDetMain',
                'information': [
                    {
                        'images': 'https://th.bing.com/th/id/OIP.hfXuuTYeAoI4aIO5mrjjEgHaEK?rs=1&pid=ImgDetMain',
                        'ingredient': '''
                        ទា កាត់ជាដុំៗល្មម
                        គ្រឿងបុក ( គល់ស្លឹកគ្រៃ ស្លឹកក្រូចសើច រមៀត រំដេង ខ្ទឹមស )
                        ម្ទេសក្រៀម ចិញ្ច្រាំអោយម៉ត់
                        សណ្ដែកដីលីង ( បុកកុំអោយម៉ត់ពេក )
                        ស្ករត្នោត អំបិល ទឹកត្រី ម្សៅស៊ុប
                        ស្លឹកក្រូចសើច
                        ស្លឹកម្រះព្រៅ ឬអាចថែមបន្លែត្រកួនក៏បានបើសិនជាចូលចិត្ត
                        ''',
                        'Step': '''
                        ដាក់ប្រេងឆាចូលក្នុងខ្ទះបន្តិច ទុកអោយក្ដៅ រួចដាក់ខ្ទឹមសចិញ្ច្រាំ និងម្ទេសក្រៀមចូលរំលីងអោយឡើងក្រហម 
                        ទើបដាក់គ្រឿងបុក សណ្ដែកដីចូល រំលីងអោយឡើងឈ្ងុយ
                        រួចដាក់សាច់ ស្ករត្នោត ម្សៅស៊ុប អំបិល ទឹកត្រី និង ទឹកបន្តិច ហើយកូរអោយសព្វចូលជាតិជាមួយគ្រឿង 
                        រួចភ្លក់មើលអោយល្មមតាមការចូលចិត្ត
                        រំងាស់ទុកអោយចូលជាតិផុយសាច់ ហើយបន្ទាប់មកដាក់ទឹកដោះគោឆៅចូល ទុកអោយពុះ ពេលដែលរីងទឹកបន្តិច 
                        ទើបដាក់ស្លឹកម្រះពៅស្លឹកក្រូចសើចចូល កូរអោយសព្វជាការស្រេច ។
                        មួយទៀតយើងអាចដាក់អំពិលទុំបន្តិចចូលក៌បានតាមការចូលចិត្ត និងដាក់ខ្ទិះដូងជំនួសទឹក ក៌បានដែរ 
                        ប្រសិនបើចូលចិត្តឈ្ងុយបែបខ្ទិះដូង
                        ''',
                    }
                ] 
            },
            {
                'namey': 'ម្ហូប ឆាក្តៅអន្ទង់',
                'imagey': 'https://i.ytimg.com/vi/QqLkDlxFJPc/maxresdefault.jpg',
                'information': [
                    {
                        'images': 'https://i.ytimg.com/vi/QqLkDlxFJPc/maxresdefault.jpg',
                        'ingredient': '''
                        អន្ទង់ 500ក្រាម
                        គ្រឿងបុក កន្លះចានចង្កឹះ
                        ម្សៅស៊ុប 1ស្លាបព្រាកាហ្វេ
                        ទឹកត្រី 1ស្លាបព្រាបាយ
                        ស្ករត្នោត កន្លះស្លាបព្រាបាយ
                        អំបិល កន្លះស្លាបព្រាកាហ្វេ
                        ប្រេងខ្យង កន្លះស្លាបព្រាបាយ
                        ម្រះព្រៅ ទៅតាមការចូលចិត្ដ
                        សណ្ដែកដីឆ្អិន កន្លះចានចង្កឹះ
                        ប្រេងឆា 2ស្លាបព្រាបបាយ
                        ម្ទេស ដាក់តាមចំនូលចិត្ត
                        ''',
                        'Step': '''
                        លាងសាច់នឹងបន្លែគ្រប់មុខអោយស្អាតល្អ
                        អន្ទង់ត្រូវលាងអោយច្រើនទឹក បើចាស់ពីដើមគាត់ច្បូតរំអិលវាជាមួយអង្កាមអោយស្អាតហើយលាងជាមួយ
                        ទឹកអំបិលបន្ថែម។ តែពេលនេះយើងគ្មានអង្កាមដូច្នេះលាងជាមួយទឹកអំបិលក្រូចឆ្មាឬទឹកសូដាក៏បាន 
                        ធ្វើយ៉ាងណាអោយស្អាតល្អ
                        បន្ទាប់មកកាត់វាជាកង់តូចៗ ចំណែកម្រះព្រៅបេះយកតែស្លឹកខ្ចីៗ
                        បុកគ្រឿង1ត្បាល់មានដូចជា គល់ស្លឹកគ្រៃ រំដេង រមៀត ស្លឹកក្រូចសើច ខ្ជាយ ខ្ទឹមសខ្ទឹមក្រហម ម្ទេស។
                        ដាក់គ្រឿងច្រើនកាន់តែឈ្ងុយឆ្ងាញ់
                        សណ្តែកដី បុកអោយម៉ត់ក៏បានមិនបុកក៏បាន
                        ចំពោះសាច់អន្ទង់ ខ្ញុំបំពងវាអោយឆ្អិនសិនមុនយកទៅឆា បើបងប្អូនមិនចង់បំពងក៏បាន
                        ដាក់ខ្ទះអោយក្តៅហើយចាក់គ្រឿងបុកចូល ឆាវាអោយឈ្ងុយសិនចាំចាក់អន្ទង់។
                        ឆាត្រលប់ទៅមក 3-4ត្រលប់សិនទើបដាក់គ្រឿងផ្សំចូល ថែមទឹកបន្តិចកុំអោយខ្លោចខ្ទះហើយដើម្បីអោយ
                        គ្រឿងចូលគ្នាជាមួយសាច់សព្វល្អ
                        ភ្លក្សរសជាតិតាមចំនូលចិត្ត ទើបដាក់សណ្តែកដីនឹងស្លឹកម្រះព្រៅជាការស្រេច
                        ''',
                    }
                ] 
            },
        ]
    }
]

def get_food_provinces():
    return jsonify(food_provinces)